export const COLORDATA = {
    multicolor: {
        fullname: 'multicolor',
        template: 'repeat(4, 1fr) / repeat(5, 1fr)',
        colors: [
            '153, 51, 122',
            '163, 65, 41',
            '173, 92, 31',
            '163, 126, 41',
            '195, 168, 34',
            '134, 45, 107',
            '143, 57, 36',
            '152, 81, 27',
            '143, 111, 36',
            '173, 150, 31',
            '127, 51, 204',
            '64, 98, 191',
            '64, 132, 191',
            '61, 143, 61',
            '41, 163, 131',
            '102, 41, 163',
            '57, 88, 172',
            '51, 105, 153',
            '54, 125, 54',
            '36, 143, 114'
        ]
    },
    flat: {
        fullname: 'flat design',
        template: 'repeat(4, 1fr) / repeat(5, 1fr)',
        colors: [
            '26, 188, 156',
            '46, 204, 113',
            '52, 152, 219',
            '155, 89, 182',
            '52, 73, 94',
            '22, 160, 133',
            '39, 174, 96',
            '41, 128, 185',
            '142, 68, 173',
            '44, 62, 80',
            '241, 196, 15',
            '230, 126, 34',
            '231, 76, 60',
            '236, 240, 241',
            '149, 165, 166',
            '243, 156, 18',
            '211, 84, 0',
            '192, 57, 43',
            '189, 195, 199',
            '127, 140, 141'
        ]
    },
    seaforest: {
        fullname: 'sea & forest',
        template: 'repeat(4, 1fr) / repeat(3, 1fr)',
        colors: [
            '156, 196, 220',
            '86, 152, 174',
            '17, 115, 148',
            '170, 198, 213',
            '71, 128, 152',
            '11, 98, 126',
            '60, 164, 68',
            '91, 149, 108',
            '157, 219, 162',
            '8, 94, 23',
            '48, 92, 63',
            '166, 205, 171'
        ]
    },
    city: {
        fullname: 'city',
        template: 'repeat(2, 1fr) / repeat(3, 1fr)',
        colors: ['223, 159, 31', '132, 132, 131', '80, 60, 50', '238, 205, 138', '173, 172, 171', '28, 20, 4']
    },
    blactowhite: {
        fullname: 'black & white',
        template: 'repeat(4, 1fr) / repeat(5, 1fr)',
        colors: [
            '255, 255, 255',
            '242, 242, 242',
            '230, 230, 230',
            '217, 217, 217',
            '204, 204, 204',
            '191, 191, 191',
            '179, 179, 179',
            '166, 166, 166',
            '153, 153, 153',
            '140, 140, 140',
            '115, 115, 115',
            '102, 102, 102',
            '89, 89, 89',
            '77, 77, 77',
            '64, 64, 64',
            '51, 51, 51',
            '38, 38, 38',
            '26, 26, 26',
            '13, 13, 13',
            '0, 0, 0'
        ]
    }
}
export const PALETTEDATA = {
    formats: [
        { format: 'hex', preview: 'hex' },
        { format: 'rgb', preview: 'rgb()' },
        { format: 'hsl', preview: 'hsl()' },
        { format: 'sharphex', preview: '#hex' },
        { format: 'rgba', preview: 'rgba()' },
        { format: 'hsla', preview: 'hsla()' }
    ],
    text: {
        menu: {
            palette: 'Палитры',
            format: 'Форматы'
        },
        notifications: {
            palette: 'Палитра изменена:',
            format: 'Формат изменён:',
            color: [
                'Потрясающий вкус!',
                'Идеально подходит!',
                'Лучший вариант!',
                'Вау!',
                'Это победа!',
                'Шедеврально!',
                'Фантастика!',
                'Чемпион всех цветов!',
                'Шедеврально!',
                'Тот самый цвет!',
                'Чума, а не цвет!',
                'Ого!',
                'Ничего себе!',
                'Прекрасный выбор!',
                'Цвет победителя!'
            ]
        }
    }
}
